{
  "question": "\nDave suggested to Fred that they rob a bank. Fred agreed and said that he would go along with Dave when he tries to rob the bank. Unbeknownst to Dave, Fred did not actually want to rob the bank. Rather, he was a member of a terrorist group who wanted to explode a hand grenade in a public place as an act of terror. When Dave asked him to participate in the bank robbery, Fred saw an opportunity to fulfill his goal while having Dave along as an unwitting armed backup. The next day, Dave and Fred approached the bank carrying handguns. Fred also had a hand grenade in his jacket pocket that Dave did not know about. Just as they walked in the bank’s front door with their guns drawn, to Dave’s astonishment, Fred removed the grenade from his pocket, pulled the pin, and threw the grenade into the bank. The explosion damaged the bank, but did not hurt anyone. Bank guard Gus saw Dave and Fred running away with their guns drawn and shot his gun at Fred, killing him. With what crimes may Dave reasonably be charged? Discuss.",
  "studentAnswer": "### Claim\n\nDave may be charged with conspiracy to commit robbery, attempted robbery, and possibly felony murder for Fred’s death.\n\n---\n\n### Rule\n\nA conspiracy occurs when two or more people agree to commit a crime and take an overt act toward its completion. Each conspirator is liable for crimes committed in furtherance of the conspiracy that are reasonably foreseeable. Attempt requires intent to commit the crime and a substantial step toward its completion. Under the felony-murder rule, a killing that occurs during the commission or attempted commission of a dangerous felony—such as robbery—is murder, even if accidental or committed by someone other than the felon, as long as the death is connected to the felony.\n\n---\n\n### Explanation\n\nThe rationale behind conspiracy is that agreement to commit a crime increases the likelihood that it will occur. Therefore, the law punishes the agreement and joint acts even if the crime is not completed. Likewise, attempt punishes conduct that goes beyond mere preparation. Felony murder extends liability to participants in inherently dangerous felonies because the risk of death is high and participants should bear the consequences. However, felony-murder liability may not extend if the killing was not in furtherance of the felony or was committed by someone opposing it (such as a police officer or victim).\n\n---\n\n### Application\n\n**Conspiracy to Commit Robbery:** Dave and Fred agreed to rob a bank. Dave proposed the idea, and Fred agreed to go along. This constitutes an agreement. Their approach to the bank with guns drawn was an overt act. Thus, Dave is guilty of conspiracy to commit robbery. It does not matter that Fred had a different motive; as long as he agreed to rob the bank, the conspiracy is formed.\n\n**Attempted Robbery:** Dave intended to rob the bank and took substantial steps—arming himself, approaching the bank, and drawing his gun. The explosion interrupted the robbery before any money was taken, but those acts likely meet the “substantial step” requirement. Dave is therefore guilty of attempted robbery.\n\n**Destruction of Property/Terrorism-Related Offense:** Fred alone intended to detonate the grenade, but Dave did not share that purpose or even know about it. Since it was outside the scope of the robbery plan, Dave likely is not guilty of the bombing or terrorism-related offense.\n\n**Felony Murder:** Fred was killed by Gus, a bank guard, while the robbery was in progress. Because the death occurred during the commission of an inherently dangerous felony, the prosecution could charge Dave with felony murder. However, a defense might argue that Fred’s death was caused by a third party acting in resistance, which some jurisdictions treat as outside the scope of felony murder. Still, under the proximate cause theory, Dave could be held liable because the death was a foreseeable result of the attempted robbery.\n\n---\n\n### Conclusion\n\nDave can be charged with (1) conspiracy to commit robbery, (2) attempted robbery, and (3) felony murder for Fred’s death. The felony-murder charge is debatable, but most courts would uphold it because the death occurred during an attempted robbery—a dangerous felony that Dave willingly joined.\n\n---\n",
  "modelAnswer": "\nQUESTION 1: SELECTED ANSWER A State v. Dave Solicitation: Requesting, urging, or tempting someone to commit a crime, with the intent that the solicitee commit the crime. Here, the facts state that \"Dave suggested to Fred that they rob a bank.\" Thus, Dave urged Fred to commit a crime, with the specific intent that Fred commit the crime. Therefore, Dave can be found guilty of Solicitation. However, Solicitation merges into the completed crime. Conspiracy: Agreement by two or more persons to commit a crime, with the intent that the crime be committed. Here, \"Fred agreed and said that he would go along with Dave when he tries to rob the bank.\" At Common Law, Conspiracy was complete upon the agreement of the co-conspirator. However, modernly, Conspiracy is a felony and requires some overt act in furtherance of the criminal objective. Here, Dave and Fred approached the bank carrying handguns. Thus, they both committed an overt act in furtherance of the criminal objective, at this point. Additionally, Dave had the specific intent to complete the criminal objective. Therefore, Dave can reasonably be charged with Conspiracy. Feigned Agreement: When only one guilty mind, there can be no Conspiracy. Here, the facts state that \"Unbeknownst to Dave, Fred did not actually want to rob the bank.\" Thus, it would seem that there was only one guilty mind. However, as Fred intended to \"explode a hand grenade in a public place,\" Fred had the requisite guilty mind. Pinkerton Rule: Each co-conspirator is held liable for all crimes that were in furtherance of the criminal objective, and all that were foreseeable. Here, the facts state that Dave did not know that Fred had a grenade, and that Dave was \"astonished\" when Fred removed the grenade from his pocket. However, the use of force by use of a deadly weapon (here, grenade) is foreseeable, as even Dave had a gun drawn. Thus, Fred's acts in relation to the grenade are foreseeable. Therefore, Dave will be guilty of crimes related to Fred's use of the grenade. Malicious Mischief: Damage or destruction of the personal property of another with malice. Here, the \"explosion damaged the bank, but did not hurt anyone.\" Thus, there was damage to the personal property of another (bank owner). Furthermore, Malice can be shown by having the specific intent to commit the crime, or a reckless disregard of an obvious risk. Here, Fred had a specific intent to carry out the \"act of terror.\" Thus, Dave can be reasonably charged with Malicious Mischief, through the vicarious liability imposed on him through the Pinkerton Rule. Attempted Robbery: A substantial step toward the commission of a Robbery with the intent to commit the Robbery. Here, Dave had his gun drawn, entered into the bank, and had the specific intent to commit a Robbery, as the facts state that \"Dave suggested to Fred that they rob a bank.\" Thus, Dave and Fred came dangerously close to the commission of a Robbery. Therefore, Dave can be reasonably charged with Attempted Robbery. Robbery: Trespassory taking and carrying away of the personal property of another from the person or their presence, by use of force or threats of force, with the intent to permanently deprive. Here, as the facts do not state that Dave actually took control and dominion of any personal property from the bank, nor satisfied the element of asportation, he cannot be found guilty of Robbery. Larceny: Trespassory taking and carrying away of the personal property of another with the intent to permanently deprive or steal. Here, similarly, Dave cannot be found guilty of Larceny. Aggravated Assault: Assault with a deadly weapon. Assault is intentionally causing a reasonable apprehension of receiving an immediate battery. Here, Dave and Fred were using guns, and a grenade (deadly weapons). Additionally, they intentionally caused Gus to reasonably apprehend that he would receive an immediate battery, as there was an apparent ability to carry out the battery by use of gun or explosive. Therefore, Dave can be reasonably charged with committing an Aggravated Assault. Burglary: Trespassory breaking and entering into the dwelling house of another, in the nighttime, with the intent to commit a felony therein. Here, Fred and Dave entered into the bank, with the specific intent to rob the bank. However, a bank is not a dwelling house. Furthermore, the facts state that Fred and Dave entered the bank \"The next day.\" Therefore, Dave cannot be charged for Common Law Burglary. Statutory Burglary: Entry into any structure with the intent to commit a crime therein. Here, Fred and Dave entered as the facts state that they \"walked in the bank's front door.\" The bank is a structure. Finally, they had the specific intent to commit a robbery therein (a crime). Therefore, Dave can reasonably be charged with Modern Burglary, but not Common Law Burglary. Murder: A homicide with malice aforethought. Homicide: The killing of one human being by another. The defendant's act must have been the actual and proximate cause of the victim's death. Killing of One Human Being: No particular means are required. Here, Fred, a human being was killed. Actual Cause: The defendant will be the actual cause of the victim's death if they would not have died but for the defendant's act. Otherwise, if there are multiple sufficient causes, the defendant will be the actual cause of the victim's death if their actions were a Substantial factor in bringing about the victim's death. Here, Fred would not have died, but for the bank guard, Gus, shooting his gun at Fred, killing him.\" However, as Dave was an accomplice to the crime, he is a Substantial Factor in bringing about Fred's death, and will be found to be the actual cause. Year and a Day Rule: Under the Common Law, the victim must die within one year and one day from the date of the incident. Here, Fred died instantly. Thus, this element is satisfied. Proximate Cause: The defendant will be the indirect proximate cause of the victim's death if there was an intervening act by a third party or act of God, and the intervening act was foreseeable. Here, the bank guard, Gus, made an effort to protect persons and property of the bank. Efforts to protect persons or property are considered foreseeable. Thus, the intervening act of Gus was foreseeable. Therefore, Dave's act of burglary is the indirect Proximate cause of Fred's death. Therefore, Dave is criminally liable for the homicide of Fred. Malice: Malice can be established by one of the following: Intent to Kill: Here, the facts do not show that Dave had the specific intent to kill Fred, nor knowledge of substantial certainty that Dave's death would occur. Thus, Malice will not be shown this way. Intent to Cause Serious Bodily Injury: Here, the facts do not show that Dave had the specific intent to cause Fred any serious bodily injury, as Dave and Fred were running away together. Thus, Malice will not be shown this way. Wanton Conduct: Showing an extreme indifference to the value of human life by an act that poses a very high risk of death, has little or no social value, done intentionally, where the defendant was aware of the risk. Here, Dave's conduct of Attempted Robbery with use of a gun (deadly weapon) constituted an act that posed a very high risk of death, and which had little or no social value, which was also done intentionally, and where Dave was aware of the risk that his actions posed. Thus, Dave can be found to have committed Wanton Conduct. However, if the courts do not find that Dave's conduct amounted to Wanton Conduct, the next best theory is Involuntary Manslaughter. Felony Murder Rule: When a death is caused during the perpetration of an inherently dangerous, collateral felony, then the underlying felony will replace and satisfy the element of Malice. Here, Dave was engaged in the act of Attempted Robbery with a deadly weapon. Thus, his act was inherently dangerous, as it posed a high risk of death. Additionally, the crime of Robbery is collateral and independent to the act which actually brought about the homicide of Fred. Thus, the Attempted Robbery by Dave will replace and satisfy the element of Malice. Res Gestae: The death must occur during the perpetration of the felony, for the defendant to be found guilty. The Res Gestae begins when the attempt of the felony becomes viable and lasts until the felon(s) reach a place of temporary or seeming safety. Here, Dave was in the bank with a gun. Thus, the attempt to rob became viable. Further, the facts state that \"Dave and Fred were running away with their guns drawn.\" Thus, they did not reach a place of temporary or seeming safety, as they were still fleeing when Fred was shot by Gus. Thus, the death occurred during the Res Gestae. Red-line View: Under the Common Law, when a co-felon dies at the hands of another, the defendant will be found guilty of Felony Murder. However, under the modern Red-line View, a defendant will not be held guilty of Felony Murder when a cofelon dies at the hands of an innocent third party. Here, Gus is an innocent third party, who actually shot and killed Fred, the co-felon. Thus, if the jurisdiction follows the Redline View, then Dave will Not be found guilty of Felony murder. However, under Common Law, Dave will be found guilty of Felony Murder. First Degree Felony Murder: When a death occurs during the perpetration of an enumerated felony. Traditionally, Burglary and Robbery are both considered enumerated felonies. Thus, if Dave is found guilty of Felony Murder (established above), he can also be reasonably found guilty of First- Degree Felony Murder. Involuntary Manslaughter: Homicide without malice while committing a wrongful act. Here, if Dave is not found guilty of Felony Murder, and his conduct is not found to amount to Wanton Conduct, then the next best theory is Involuntary Manslaughter. Dave is liable for the homicide of Fred (established above). If malice cannot be found, then Dave’s wrongful act of Assault will suffice. Therefore, Dave can be reasonably charged with Involuntary Manslaughter. Therefore, Dave can be reasonably charged with committing Solicitation, Conspiracy, Attempted Robbery, Statutory Burglary, Malicious Mischief, Aggravated Assault, Second Degree Felony Murder or First- Degree Felony Murder, or Involuntary Manslaughte",
  "rubric": "Of course. Here is a comprehensive grading rubric for the provided legal writing assessment question, formatted with clear scoring criteria for each component.\n\n---\n\n### **Grading Rubric: Criminal Law Assessment (Dave & Fred)**\n\nThis rubric is designed to evaluate student responses to the provided fact pattern. The assessment focuses on the ability to identify relevant legal issues, state the applicable rules of law, apply those rules to the specific facts, and present the analysis in a clear and organized manner.\n\n**Total Points Possible: 100**\n\n---\n\n### **1. Analytical Depth (50% | 50 points)**\n\nThis is the most critical component, assessing the student's ability to apply legal rules to the facts and analyze the nuances of the case. It evaluates the *why* and *how* behind the conclusions.\n\n| **Score** | **Performance Level** | **Criteria** |\n| :--- | :--- | :--- |\n| **45-50 pts** | **Excellent** | **- Felony Murder:** Sophisticated analysis of felony murder liability for Fred’s death. Crucially, the student identifies that the shooter was a third party (Gus) and **analyzes Dave's liability under both the Majority \"Agency Theory\" and the Minority \"Proximate Cause Theory,\"** explaining the different outcomes under each. <br><br> **- Conspiracy:** Correctly analyzes the conspiracy charge, noting the issue of Fred’s feigned agreement. Discusses the distinction between the traditional **bilateral approach** (requiring a true \"meeting of the minds\") and the modern **unilateral/MPC approach** (where only one party needs genuine intent), concluding Dave is likely guilty of conspiracy under the modern view. <br><br> **- Co-Conspirator Liability (Pinkerton Rule):** Thoughtfully analyzes whether Dave is liable for Fred's act of exploding the grenade. Correctly applies the Pinkerton rule, arguing persuasively whether the act was both **foreseeable** and **in furtherance of** the original bank robbery conspiracy (likely concluding it was neither). <br><br> **- Attempt:** Clearly applies the facts (approaching with guns drawn) to the \"substantial step\" element of attempt. |\n| **35-44 pts** | **Proficient** | **- Felony Murder:** Correctly analyzes felony murder but discusses only **one** of the major theories (typically the agency theory) without acknowledging the alternative, leading to a sound but incomplete analysis. <br><br> **- Conspiracy:** Identifies the conspiracy and correctly applies the elements but may not fully explore the nuance of the unilateral/bilateral distinction, or does so in a cursory manner. <br><br> **- Co-Conspirator Liability:** Acknowledges that Dave is likely not responsible for the grenade but provides a shallow analysis, perhaps only stating it wasn't foreseeable without discussing the \"in furtherance of\" prong of the Pinkerton rule. <br><br> **- Attempt:** Correctly analyzes the attempted robbery charge. |\n| **25-34 pts** | **Developing** | **- Felony Murder:** Analysis is conclusory or flawed. For example, states \"Dave is guilty of felony murder because Fred died during a felony\" without analyzing who did the killing or the relevant legal theories. <br><br> **- Conspiracy / Co-Conspirator Liability:** Shows confusion between direct liability and co-conspirator liability. May incorrectly hold Dave responsible for the grenade because he was a co-conspirator, without proper application of the Pinkerton rule. <br><br> **- General:** Tends to state conclusions without connecting them back to specific facts or rule elements. The application of law to fact is weak. |\n| **0-24 pts** | **Needs Improvement**| - Fails to engage in substantive legal analysis, largely just restating facts. <br>- Application of rules is illogical, fundamentally incorrect, or absent. <br>- Shows a significant misunderstanding of core criminal law concepts like felony murder or conspiracy. |\n\n---\n\n### **2. Rule Statement (20% | 20 points)**\n\nThis component assesses the student's ability to accurately and completely state the relevant legal rules before applying them.\n\n| **Score** | **Performance Level** | **Criteria** |\n| :--- | :--- | :--- |\n| **18-20 pts**| **Excellent** | - States all relevant rules clearly, accurately, and completely. <br>- **Conspiracy:** Defines agreement, intent, and any overt act requirement. <br>- **Attempt:** Defines intent and the jurisdiction's standard (e.g., \"substantial step\"). <br>- **Felony Murder:** Defines the rule (a killing during the commission of an inherently dangerous felony) and, critically, **defines both the Agency and Proximate Cause theories.** <br>- **Co-Conspirator Liability:** Accurately states the Pinkerton rule (liability for co-conspirator crimes that are foreseeable and in furtherance of the conspiracy). |\n| **14-17 pts**| **Proficient** | - States most relevant rules correctly, but some may be slightly imprecise or incomplete. <br>- For example, may state the general felony murder rule but fail to articulate the crucial distinction between the agency and proximate cause theories. May state the Pinkerton rule but omit one of its elements (e.g., foreseeability). |\n| **10-13 pts**| **Developing** | - States some rules incorrectly or incompletely. <br>- Rules may be vague (e.g., \"Felony murder is when someone dies during a felony.\"). <br>- May confuse elements of different crimes (e.g., mixes up elements of conspiracy and attempt). |\n| **0-9 pts** | **Needs Improvement** | - Fails to state the relevant legal rules or states them in a way that is fundamentally incorrect and unusable for analysis. |\n\n---\n\n### **3. Issue Spotting (15% | 15 points)**\n\nThis component assesses the student's ability to read the fact pattern and identify all the potential crimes and legal issues raised.\n\n| **Score** | **Performance Level** | **Criteria** |\n| :--- | :--- | :--- |\n| **13-15 pts**| **Excellent** | - Identifies all major, plausible issues for which Dave could be charged: <br>   1. **Conspiracy** to Commit Bank Robbery <br>   2. **Attempted** Bank Robbery <br>   3. **Felony Murder** for the death of Fred <br>   4. **Accomplice/Co-conspirator liability** for the property damage caused by the grenade |\n| **10-12 pts**| **Proficient** | - Identifies the most obvious, high-level issues (Conspiracy, Attempt, and Felony Murder). <br>- May miss the more nuanced issue of co-conspirator liability for the separate crime of exploding the grenade. |\n| **7-9 pts**  | **Developing** | - Identifies only one or two of the major issues (e.g., only discusses Attempt and Felony Murder). <br>- Misses several key issues, leading to an incomplete answer. |\n| **0-6 pts**  | **Needs Improvement**| - Fails to identify any of the central legal issues or mischaracterizes the issues entirely (e.g., charges Dave with murder instead of analyzing felony murder). |\n\n---\n\n### **4. Organization (15% | 15 points)**\n\nThis component assesses the structure, clarity, and readability of the response. A well-organized answer allows the reader to easily follow the student's legal reasoning.\n\n| **Score** | **Performance Level** | **Criteria** |\n| :--- | :--- | :--- |\n| **13-15 pts**| **Excellent** | - Exceptionally well-organized, using a crime-by-crime structure. <br>- Employs a clear paradigm for legal analysis (e.g., IRAC/CRAC) for each issue discussed. <br>- Uses headings and subheadings effectively to guide the reader. <br>- Analysis flows logically from rule to application to conclusion. The response is easy to read and understand. |\n| **10-12 pts**| **Proficient** | - Generally well-organized, but may have minor structural flaws. <br>- May not consistently use a clear analytical paradigm (IRAC/CRAC) for every issue. <br>- The overall argument is followable, but the reader may have to do some work to connect ideas. |\n| **7-9 pts**  | **Developing** | - Lacks clear organization. The response may jump between issues without clear transitions. <br>- IRAC/CRAC is used improperly or not at all. Rules, facts, and analysis are jumbled together. <br>- Difficult to follow the student's train of thought. |\n| **0-6 pts**  | **Needs Improvement**| - The response is disorganized and chaotic. <br>- There is no discernible structure, making the argument incoherent and impossible to follow. |",
  "metadata": {
    "generatedAt": "2025-10-24T16:33:38.077Z",
    "generatedFields": [
      "rubric"
    ]
  }
}